In [1]:
import psycopg2
import psycopg2.extras
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database = "ecomdb",
                                          user = "postgres",
                                          password = "*",
                                          host = "127.0.0.1",
                                          port = "5432")
    def getConnection(self):
        print("Connection to DB established!")
        return self.connection
con = PostgresConnection().getConnection()

Connection to DB established!

**Q1: Find the division/district/year/month wise total_sale_price joining fact table and respective dimension table. **

division wise total_sale_price joining fact table and store dimension table

In [3]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.division as "Division", SUM(fact_table.total_price) "Total Sale Price" 
FROM star_schema.fact_table 
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY CUBE(store_dim.division) 
ORDER BY store_dim.division"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_division = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [143]:
total_price_by_division

     Division  Total Sale Price
0     BARISAL      7.520344e+06
1  CHITTAGONG      1.976360e+07
2       DHAKA      4.076462e+07
3      KHULNA      1.131161e+07
4    RAJSHAHI      1.209920e+07
5     RANGPUR      8.429836e+06
6      SYLHET      5.512234e+06
7        None      1.054014e+08

district wise total_sale_price joining fact table and store dimension table

In [5]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.total_price) "Total Sale Price" 
FROM star_schema.fact_table 
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY CUBE(store_dim.district) 
ORDER BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_district = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [6]:
total_price_by_district

      District  Total Sale Price
0     BAGERHAT      1.307651e+06
1    BANDARBAN      9.953608e+05
2      BARGUNA      8.690410e+05
3      BARISAL      2.897238e+06
4        BHOLA      1.012206e+06
..         ...               ...
60   SUNAMGANJ      1.593774e+06
61      SYLHET      1.727717e+06
62     TANGAIL      1.774650e+06
63  THAKURGAON      7.299342e+05
64        None      1.054014e+08

[65 rows x 2 columns]

year wise total_sale_price joining fact table and Time dimension table

In [7]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY CUBE(time_data.year)
ORDER BY time_data.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_year = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [8]:
total_price_by_year

     Year  Total Sale Price
0  2014.0      1.433473e+07
1  2015.0      1.509572e+07
2  2016.0      1.497651e+07
3  2017.0      1.501581e+07
4  2018.0      1.510820e+07
5  2019.0      1.494951e+07
6  2020.0      1.503719e+07
7  2021.0      8.837722e+05
8     NaN      1.054014e+08

month wise total_sale_price joining fact table and Time dimension table

In [9]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.month as "Month", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY CUBE(time_data.month)
ORDER BY time_data.month"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_month = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [10]:
total_price_by_month

    Month  Total Sale Price
0     1.0      9.042244e+06
1     2.0      8.073878e+06
2     3.0      8.939152e+06
3     4.0      8.504635e+06
4     5.0      9.078002e+06
5     6.0      8.556853e+06
6     7.0      9.046580e+06
7     8.0      8.929475e+06
8     9.0      8.724326e+06
9    10.0      8.902784e+06
10   11.0      8.680026e+06
11   12.0      8.923480e+06
12    NaN      1.054014e+08

**Q2: Find the customer/bank/transaction(cash/online) wise total_sale_price joining fact table and respective dimension table **

customer wise total sale price joining fact table and customer dimension table

In [146]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT customer_dim.name as "Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.customer_dim ON customer_dim.coustomer_key = fact_table.coustomer_key
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
WHERE (trans_type = 'cash' OR trans_type = 'mobile')
GROUP BY CUBE(customer_dim.name)
ORDER BY customer_dim.name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_customer = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [147]:
total_price_by_customer

             Name  Total Sale Price
0               -           2191.50
1            ????           1670.75
2           ?????           1968.25
3        ????? ??           1044.50
4          ??????            498.50
...           ...               ...
4531       zeenat           2207.50
4532   zenab khan            733.00
4533  zina kumari            999.25
4534      ziyabul            638.25
4535         None       10818397.25

[4536 rows x 2 columns]

bank wise total sale price joining fact table and Transaction dimension table

In [13]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.bank_name as "Bank Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY CUBE(trans_dim.bank_name)
ORDER BY trans_dim.bank_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_bank= pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [14]:
total_price_by_bank

                                            Bank Name  Total Sale Price
0                                     AB Bank Limited      2.728516e+06
1                    Bangladesh Commerce Bank Limited      2.730999e+06
2                                   Bank Asia Limited      2.687143e+06
3                          Bengal Commercial Bank Ltd      2.704554e+06
4                                               Bkash      2.689352e+06
5                                   BRAC Bank Limited      2.705796e+06
6                               Citizens Bank Limited      2.723215e+06
7                                   City Bank Limited      2.713952e+06
8                   Community Bank Bangladesh Limited      2.685752e+06
9                                  Dhaka Bank Limited      2.728366e+06
10                          Dutch-Bangla Bank Limited      2.692435e+06
11                               Eastern Bank Limited      2.687182e+06
12                                  IFIC Bank Limited      2.699760e+06
13                                Jamuna Bank Limited      2.689886e+06
14                                Meghna Bank Limited      2.700528e+06
15                            Mercantile Bank Limited      2.676578e+06
16                               Midland Bank Limited      2.688430e+06
17                             Modhumoti Bank Limited      2.715279e+06
18                          Mutual Trust Bank Limited      2.670030e+06
19                                              Nagad      2.699554e+06
20                              National Bank Limited      2.697294e+06
21            National Credit & Commerce Bank Limited      2.723363e+06
22                                               None      2.708516e+06
23                                   NRB Bank Limited      2.711595e+06
24                            NRB Commercial Bank Ltd      2.692016e+06
25                                NRB Global Bank Ltd      2.700088e+06
26                                   One Bank Limited      2.692043e+06
27                                 Padma Bank Limited      2.708084e+06
28                               Premier Bank Limited      2.690828e+06
29                                 Prime Bank Limited      2.698896e+06
30                                Pubali Bank Limited      2.682788e+06
31                                             Rocket      2.720974e+06
32                                  Shimanto Bank Ltd      2.685805e+06
33  South Bangla Agriculture and Commerce Bank Lim...      2.728115e+06
34                             Southeast Bank Limited      2.691276e+06
35                              Standard Bank Limited      2.727661e+06
36                                 Trust Bank Limited      2.720807e+06
37                         United Commercial Bank Ltd      2.696855e+06
38                                Uttara Bank Limited      2.707120e+06
39                                               None      1.054014e+08

transaction wise total sale price joining fact table and Transaction dimension table

In [15]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.trans_type as "Transaction Type", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY CUBE(trans_dim.trans_type)
ORDER BY trans_dim.trans_type"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_trans_type = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [16]:
total_price_by_trans_type

  Transaction Type  Total Sale Price
0             card      9.458304e+07
1             cash      2.708516e+06
2           mobile      8.109882e+06
3             None      1.054014e+08

Total Sales in Barisal

In [68]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.total_price) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
WHERE store_dim.district = 'BARISAL'
GROUP BY CUBE(store_dim.district)"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [69]:
total_sales_in_barisal

  District  Total Sales
0  BARISAL   2897237.75
1     None   2897237.75

Total Sales in 2015

In [70]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.total_price) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
WHERE time_data.year = '2015'
GROUP BY CUBE(time_data.year)"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015 = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [71]:
total_sales_in_2015

     Year  Total Sales
0  2015.0  15095720.25
1     NaN  15095720.25

Total Sales in 2015 and in Barisal

In [148]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", store_dim.district as "District", SUM(fact_table.total_price) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.time_data 
ON time_data.time_key = fact_table.time_key 
JOIN star_schema.store_dim 
ON store_dim.store_key = fact_table.store_key
WHERE time_data.year = '2015'
AND store_dim.district = 'BARISAL'
GROUP BY CUBE(time_data.year,store_dim.district)"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015_and_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [150]:
total_sales_in_2015_and_barisal.dropna()

     Year District  Total Sales
0  2015.0  BARISAL    415748.75

Q6: For each store(item supplier), what are the top three products offered that are most often purchased?

In [55]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.store_key,
	item_dim.item_name, 
	SUM(quantity) as "Quantity Sales"
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
GROUP BY store_dim.store_key,item_dim.item_name
ORDER BY store_key, SUM(quantity) DESC"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
top_three_products = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [151]:
top_three_products = top_three_products.groupby('store_key').head(3)
top_three_products

       store_key                                item_name  Quantity Sales
0          S0001                       Pepsi - 12 oz cans              92
1          S0001      Muscle Milk Protein Shake Van. 11oz              90
2          S0001         Hefty Supreme Foam Plates 6 inch              78
257        S0002             Planters Nut-trition 1.5 oz               83
258        S0002              Altoids Small Packs Variety              80
...          ...                                      ...             ...
186597     S0098  Cliff Builders Protein Bar Variety Pack              84
186598     S0098                       Pepsi - 12 oz cans              79
186855     S0099                       Pepsi - 12 oz cans              93
186856     S0099                   Diet Coke - 12 oz cans              87
186857     S0099    Coffee-mate Original Powdered Creamer              86

[2178 rows x 3 columns]

Q7: What products have been sold through card or mobile since X days?

In [121]:
from datetime import datetime
print("Please insert the date range in 'day month, year' format")
start_date = input()
end_date = input()
# date = "12/11/2018 09:15:32"
# date = datetime.strptime(date, "%d/%m/%Y %H:%M:%S")
start_date = datetime.strptime(start_date,'%d %B, %Y')
end_date = datetime.strptime(end_date,'%d %B, %Y')

Please insert the date range in 'day month, year' format
8 January, 2018
18 January, 2018

In [124]:
con = PostgresConnection().getConnection()
insert_stmt = f"""SELECT item_dim.item_name, trans_dim.trans_type, time_data.date
FROM star_schema.fact_table
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
WHERE time_data.date >= '{start_date}' AND time_data.date<= '{end_date}' AND(trans_dim.trans_type = 'card' OR trans_dim.trans_type = 'mobile')
GROUP BY CUBE(item_name,trans_type,date) 
ORDER BY item_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
products_sold = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [126]:
products_sold = products_sold.dropna()
products_sold= products_sold.drop(['trans_type', 'date'], axis=1)
products_sold.item_name.drop_duplicates().tolist()

Q8: What season(quarter) is the worst for each product item? As example,

In [82]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT item_dim.item_name, quarter, SUM(quantity)
FROM star_schema.fact_table
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY CUBE(item_name, time_data.quarter)
ORDER BY item_name, SUM(quantity)"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
worst_season = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [91]:
worst_season.groupby('item_name').head(1)

                                  item_name quarter   sum
0           100% Juice Box Variety 6.75 oz       Q1  5698
5                A&W Root Beer - 12 oz cans      Q2  5735
10          A&W Root Beer Diet - 12 oz cans      Q4  5589
15                     Advil 2 pill packets      Q1  5453
20            All Purpose Cleaner 409 Spray      Q1  5325
...                                     ...     ...   ...
1270        Welch's 100% Juice Variety10 oz      Q2  5494
1275     Wint O Green LifeSavers Sugar Free      Q1  5323
1280        Wonderful Pistachios (in shell)      Q1  5578
1285  Yoplait Original Yogurt Variety Pack       Q1  5426
1290            Zoo Animal Cookies/Crackers      Q1  5462

[259 rows x 3 columns]

Q9: Break down the total sales of items geographically (division-wise).

In [87]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT item_name,division,  SUM(quantity)
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
GROUP BY CUBE(division, item_dim.item_name)
ORDER BY item_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_geographically = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [89]:
total_sales_geographically.dropna()

                            item_name    division   sum
0     100% Juice Box Variety 6.75 oz      RANGPUR  1779
1     100% Juice Box Variety 6.75 oz     RAJSHAHI  2582
2     100% Juice Box Variety 6.75 oz   CHITTAGONG  4330
3     100% Juice Box Variety 6.75 oz      BARISAL  1586
4     100% Juice Box Variety 6.75 oz       SYLHET  1218
...                               ...         ...   ...
2067      Zoo Animal Cookies/Crackers     BARISAL  1727
2068      Zoo Animal Cookies/Crackers      KHULNA  2531
2069      Zoo Animal Cookies/Crackers       DHAKA  8449
2070      Zoo Animal Cookies/Crackers      SYLHET  1052
2071      Zoo Animal Cookies/Crackers     RANGPUR  1799

[1813 rows x 3 columns]

Q10: What are the average sales of products sales per store monthly?

In [140]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.store_key as "STORE", month as "MONTH", SUM(total_price)/30 as "Average sales"
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY CUBE(store_dim.store_key, time_data."month")
ORDER By store_dim.store_key, month"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
avg_sales_prod = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [141]:
avg_sales_prod.dropna()

      STORE  MONTH  Average sales
0     S0001    1.0     377.983333
1     S0001    2.0     345.316667
2     S0001    3.0     390.250000
3     S0001    4.0     372.450000
4     S0001    5.0     371.558333
...     ...    ...            ...
9432  S0099    8.0     314.558333
9433  S0099    9.0     410.891667
9434  S0099   10.0     452.275000
9435  S0099   11.0     368.675000
9436  S0099   12.0     356.725000

[8712 rows x 3 columns]